Revit 2027 API
FaceWall.Create Method
 Creates a new instance of a wall attached to a non-vertical massing face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FaceWall Create(
	Document document,
	ElementId wallType,
	WallLocationLine locationLine,
	Reference faceReference
)
Public Shared Function Create (
	document As Document,
	wallType As ElementId,
	locationLine As WallLocationLine,
	faceReference As Reference
) As FaceWall
public:
static FaceWall^ Create(
	Document^ document,
	ElementId^ wallType,
	WallLocationLine locationLine,
	Reference^ faceReference
)
static member Create :
        document : Document *
        wallType : ElementId *
        locationLine : WallLocationLine *
        faceReference : Reference -> FaceWall
Parameters
document Document
 The document.
wallType ElementId
 The wall type. This must be a wall type accepted by IsWallTypeValidForFaceWall()
locationLine WallLocationLine
 The alignment of the wall location line.
faceReference Reference
 The reference from the massing face. This must pass IsValidFaceReferenceForFaceWall()
Return Value
FaceWall
 The newly created face wall.
Exceptions
Exception | Condition
ArgumentException |  The element wallType does not exist in the document -or- document is not a project document. -or- This wall type cannot be applied to a face wall. -or- This reference cannot be applied to a face wall.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
ForbiddenForDynamicUpdateException |  During a dynamic update, the newly created face wall is going to be joined to surrounding structures.
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The element is a member of a loaded family. -or- The element is a member of a group type that is not being edited.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
Remarks
 This method will regenerate the document.
See Also
Reference
FaceWall Class
Autodesk.Revit.DB Namespace